In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b':20, 'c':30}

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
# also can put built-in functions in Series, which cannot be achieved by just array!
pd.Series(data = [sum, len])

0    <built-in function sum>
1    <built-in function len>
dtype: object

In [16]:
# the key to use Series is to use its Index!
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [17]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [18]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [19]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [20]:
ser1['USA']

1

In [26]:
ser3 = pd.Series(data = labels)

In [27]:
ser3[0]

'a'

In [28]:
ser1 + ser2 # like a outer join! but not...

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [29]:
# the most important part!!! DataFrames!!!!!

In [32]:
from numpy.random import randn

In [34]:
np.random.seed(101)

In [35]:
df = pd.DataFrame(randn(5,4), ['a', 'b', 'c', 'd', 'e'], ['w', 'x', 'y', 'z'])

In [36]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [37]:
# a DF is just a bunch of Series that sharing the same Index!

In [39]:
df['w'] # <---- always use this notation for getting a col

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [40]:
df[['w', 'z']] # for multiple cols, use a list of the col names!!!!

          w         z
a  2.706850  0.503826
b  0.651118  0.605965
c -2.018168 -0.589001
d  0.188695  0.955057
e  0.190794  0.683509

In [41]:
df['new'] = df['w'] + df['y'] # add new col

In [42]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [43]:
# remove a col
df.drop('new', axis = 1) # this does not impact the actual DF...

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [44]:
# for drop() function, the default setting for inplace is False, which is to prevent
# accidentally deleting original DF
# however, if we intend to make changes to the original DF
df.drop('new', axis = 1, inplace = True) # <------ set it to be True

In [46]:
df.drop('e')

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [47]:
df.shape # so the row axis is index = 0, and col axis is index = 1

(5, 4)

In [49]:
df.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [50]:
df.iloc[0] # index-based location

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [51]:
df.loc['b', 'y']

-0.84807698340363147

In [52]:
df.loc[['a','b'], ['x', 'y']]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077

In [53]:
# conditional selection of DF
bool_df = df > 0

In [55]:
df[bool_df]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [59]:
df[df['w'] > 0] # exclude the rows which are FALSE!
# get a DF in return!
result = df[df['w']>0]['x'] #<--- all in one step!
# one-liners~

In [60]:
result

a    0.628133
b   -0.319318
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [57]:
df[df['z']<0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [61]:
# multiple conditions &
df[(df['w']>0) & (df['y'] >1)]

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [62]:
# multiple conditions | <-- pipe command.
df[(df['w']>0) | (df['y']>1)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [63]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [64]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [65]:
newind = 'CA NY WY OR CD'.split()

In [66]:
newind

['CA', 'NY', 'WY', 'OR', 'CD']

In [67]:
df['states'] = newind

In [68]:
df

          w         x         y         z states
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR
e  0.190794  1.978757  2.605967  0.683509     CD

In [69]:
# make a col into the index?
df.set_index('states')

               w         x         y         z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CD      0.190794  1.978757  2.605967  0.683509

In [70]:
# if you want the change to be permanent, need to set the inplace value to be True.

In [72]:
# multi-index, and index-hierarchy.
# Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [73]:
hier_index

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [74]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [80]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [76]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [79]:
df.index.names = ['Groups', 'Num']

In [81]:
df.loc['G2'].loc[2]['B']

0.072959675317038689

In [83]:
df.loc['G1'].loc[2]['B']

-1.1591194155484297

In [84]:
# cross-section?
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [86]:
df.xs(1, level = 'Num')

# go inside to multiple levels and grab the info out!!!!!

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [87]:
##############
# missing data
################

In [88]:
d = {'A':[1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [89]:
df = pd.DataFrame(d)

In [90]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [91]:
# drop NA?
# remove any row or col with at least one NaN, choose axis = 0 or 1
df.dropna()

     A    B  C
0  1.0  5.0  1

In [92]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [93]:
# if you want to specify how many NaN you want to start dropping???
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [94]:
df.fillna(value = "Fill")

      A     B  C
0     1     5  1
1     2  Fill  2
2  Fill  Fill  3

In [95]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [96]:
##################
# group by
##################

In [97]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [99]:
df_comp = pd.DataFrame(data)

In [100]:
df_comp

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [103]:
df_comp.groupby('Company') # <-- this is a groupby object
byComp = df_comp.groupby('Company')

In [104]:
byComp.mean() #<-- pandas automatically ignores anything that cannot be aggregated...

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [105]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [108]:
df_comp.groupby('Company').mean().loc['GOOG']

Sales    160.0
Name: GOOG, dtype: float64

In [110]:
df_comp.groupby('Company').describe().transpose()['GOOG']

       count   mean        std    min    25%    50%    75%    max
Sales    2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0

In [111]:
#############################################
# merging joining and concatenating 
##############################################

In [112]:
# see the notebook itself
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [113]:
pd.concat([df1, df2, df3]) # axis = 0 union by rows

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [114]:
pd.concat([df1, df2, df3], axis = 1) # join on the col side, but if the row index is missing
# alot of NaN...

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [115]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [117]:
# join key?
pd.merge(left, right, how = 'inner', on = 'key') # the inner join is the default method!

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [118]:
# on multiple keys? keys as cols
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [119]:
pd.merge(left, right, how  = 'inner', on = ['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [120]:
pd.merge(left, right, how = 'left', on = ['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

In [121]:
#############################
# join, is used on index!!!!
##############################
# two potentially different indexing DFs.

In [123]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [124]:
left.join(right) # automated inner join~

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [126]:
left.join(right, how = 'right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [127]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [129]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [130]:
df['col2'].unique()

array([444, 555, 666])

In [131]:
df['col2'].nunique()

3

In [132]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [136]:
df[(df['col1'] >2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [137]:
def times2(x):
    return x*2

In [138]:
# apply function to each row of a col?
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [139]:
df['col2'].apply(lambda col: col*2)
# powerful

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [140]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [141]:
df.columns

Index([u'col1', u'col2', u'col3'], dtype='object')

In [143]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [144]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [145]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [146]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [147]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [148]:
#############################
# data input and output
###############################

In [149]:
pwd

u'/Users/miaojun/Documents/python data science/Python-Data-Science-and-Machine-Learning-Bootcamp'

In [152]:
ls

Big-Data-and-Spark/            Python-Crash-Course/
Data-Capstone-Projects/        Python-for-Data-Analysis/
Deep Learning/                 Python-for-Data-Visualization/
Machine Learning Sections/     README.md
Pierian_Data_Logo.png          Welcome to the Course.ipynb
Practise Pandas.ipynb

In [153]:
cd Python-for-Data-Analysis/Pandas/

/Users/miaojun/Documents/python data science/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-for-Data-Analysis/Pandas

In [156]:
df = pd.read_csv('example')

In [157]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [158]:
df.to_csv('my_output', index = False)

In [159]:
pd.read_csv("my_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [160]:
# excel?
# workbook has a bunch of sheets, and each sheet is a DataFrame~

In [161]:
pd.read_excel("Excel_Sample.xlsx", sheetname = "Sheet1")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [162]:
df.to_excel('Excel_sample2.xlsx', sheet_name = "New Sheet")

In [163]:
###################
# from the internet~~~
#####################

In [164]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [165]:
type(data)
# so find each of the table component in the website, and put them in a list
# and make all the tables DataFrames

list

In [167]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [168]:
#########################
# SQL
#########################

In [169]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

In [173]:
df.to_sql('my_table', engine)

ValueError: Table 'my_table' already exists.

In [176]:
sqldf = pd.read_sql('select * from my_table', con=engine)

In [177]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15